cases/openfoam/fluids/bernard-cells-3d/solution/tutorial-ref/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="$(getApplication)"
echo $application

runApplication blockMesh
runApplication buoyantFoam

#------------------------------------------------------------------------------
